## Page 2: Tourism, only need the tourism_arrival and tourism_departures

In [38]:
import pandas as pd
# !pip3 install pycountry_convert
import pycountry
import pycountry_convert as pc

In [39]:
years = [str(i) for i in range(1995, 2021)]
years.append('Country Name')
arrival = pd.read_csv('data/tourism/tourism_arrivals.csv', usecols=years, skiprows=4)
depart = pd.read_csv('data/tourism/tourism_departures.csv', usecols=years, skiprows=4)
print(arrival.shape, depart.shape)

(266, 27) (266, 27)

In [40]:
arrival.columns

Index(['Country Name', '1995', '1996', '1997', '1998', '1999', '2000', '2001',
       '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019',
       '2020'],
      dtype='object')

In [41]:
# Melt the DataFrame to have years in rows
melted_arrival = pd.melt(arrival, id_vars=['Country Name'], var_name='Year', value_name='Arrivals')
melted_depart = pd.melt(depart, id_vars=['Country Name'], var_name='Year', value_name='Departures')
print(melted_arrival.shape, melted_depart.shape)

(6916, 3) (6916, 3)

In [42]:
melted_arrival.head()

                  Country Name  Year      Arrivals
0                        Aruba  1995  9.120000e+05
1  Africa Eastern and Southern  1995  1.158354e+07
2                  Afghanistan  1995           NaN
3   Africa Western and Central  1995  2.670706e+06
4                       Angola  1995  9.000000e+03

In [43]:
melted_depart.head()

                  Country Name  Year  Departures
0                        Aruba  1995         NaN
1  Africa Eastern and Southern  1995         NaN
2                  Afghanistan  1995         NaN
3   Africa Western and Central  1995         NaN
4                       Angola  1995      3000.0

In [44]:
arr_depart = melted_arrival.merge(melted_depart)
arr_depart.shape

(6916, 4)

In [45]:
arr_depart.head()

                  Country Name  Year      Arrivals  Departures
0                        Aruba  1995  9.120000e+05         NaN
1  Africa Eastern and Southern  1995  1.158354e+07         NaN
2                  Afghanistan  1995           NaN         NaN
3   Africa Western and Central  1995  2.670706e+06         NaN
4                       Angola  1995  9.000000e+03      3000.0

Append the country codes back into the dataframe for easier country identification

In [46]:
country_code = pd.read_csv('data/tourism/tourism_arrivals.csv', usecols=['Country Name', 'Country Code'], skiprows=4)
country_code.shape

(266, 2)

In [47]:
arr_depart = pd.merge(arr_depart, country_code, how='left')
arr_depart.head()

                  Country Name  Year      Arrivals  Departures Country Code
0                        Aruba  1995  9.120000e+05         NaN          ABW
1  Africa Eastern and Southern  1995  1.158354e+07         NaN          AFE
2                  Afghanistan  1995           NaN         NaN          AFG
3   Africa Western and Central  1995  2.670706e+06         NaN          AFW
4                       Angola  1995  9.000000e+03      3000.0          AGO

Calculate Departure / Arrival ratio for choropleth visualization

In [48]:
arr_depart['DA_Ratio'] = arr_depart['Departures'] / arr_depart['Arrivals']
arr_depart.rename(columns={'Country Name': 'Country', 'Country Code': 'Country_code'}, inplace=True)
arr_depart.head()

,Country,Year,Arrivals,Departures,Country_code,DA_Ratio
0,Aruba,1995,9.120000e+05,NaN,ABW,NaN
1,Africa Eastern and Southern,1995,1.158354e+07,NaN,AFE,NaN
2,Afghanistan,1995,NaN,NaN,AFG,NaN
3,Africa Western and Central,1995,2.670706e+06,NaN,AFW,NaN
4,Angola,1995,9.000000e+03,3000.0,AGO,0.333333

Get the continent information so that we can categorize countries in continents.

In [49]:
def get_continent(country_code):
    try:
        country_alpha2 = pc.country_alpha3_to_country_alpha2(country_code)
        country_continent_code = pc.country_alpha2_to_continent_code(country_alpha2)
        country_continent_name = pc.convert_continent_code_to_continent_name(country_continent_code)
        return country_continent_name
    except KeyError:
        return None

In [50]:
arr_depart['Continent'] = arr_depart['Country_code'].apply(get_continent)

In [51]:
arr_depart.head()

,Country,Year,Arrivals,Departures,Country_code,DA_Ratio,Continent
0,Aruba,1995,9.120000e+05,NaN,ABW,NaN,North America
1,Africa Eastern and Southern,1995,1.158354e+07,NaN,AFE,NaN,None
2,Afghanistan,1995,NaN,NaN,AFG,NaN,Asia
3,Africa Western and Central,1995,2.670706e+06,NaN,AFW,NaN,None
4,Angola,1995,9.000000e+03,3000.0,AGO,0.333333,Africa

In [52]:
arr_depart['Continent'].unique()

array(['North America', None, 'Asia', 'Africa', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [53]:
arr_depart.shape

(6916, 7)

There are some regions included in the data we downloaded, so it is expected that there will be rows that do not match to a specific continent. Since they're not countries, we want to drop them.

In [54]:
# Drop rows that cannot be matched to a continent
final = arr_depart.dropna(subset=['Continent'])
final.shape

(5538, 7)

In [55]:
# Combine the Americas (North and South America should count as one category)
final['Continent'] = final['Continent'].apply(lambda x: 'America' if 'America' in x else x)

/var/folders/62/f84_mp192073x9pd72l46fth0000gn/T/ipykernel_42821/1742644629.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final['Continent'] = final['Continent'].apply(lambda x: 'America' if 'America' in x else x)

In [56]:
final.head()

       Country  Year  Arrivals  Departures Country_code  DA_Ratio Continent
0        Aruba  1995  912000.0         NaN          ABW       NaN   America
2  Afghanistan  1995       NaN         NaN          AFG       NaN      Asia
4       Angola  1995    9000.0      3000.0          AGO  0.333333    Africa
5      Albania  1995  304000.0         NaN          ALB       NaN    Europe
6      Andorra  1995       NaN         NaN          AND       NaN    Europe

Check datatypes of each column.

In [57]:
final.dtypes

Country          object
Year             object
Arrivals        float64
Departures      float64
Country_code     object
DA_Ratio        float64
Continent        object
dtype: object

Column 'Year' is an object, change it to integer instead.

In [58]:
final['Year'] = pd.to_numeric(final['Year'])

/var/folders/62/f84_mp192073x9pd72l46fth0000gn/T/ipykernel_42821/3691554115.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final['Year'] = pd.to_numeric(final['Year'])

Output the file as JSON so d3 can read in data

In [59]:
final.to_json('data/tourism/tourism_arr_dep.json', orient='records')

In [13]:
final = pd.read_json('data/tourism/tourism_arr_dep.json')

In [15]:
final[final['Country'] == 'United States']

            Country  Year      Arrivals    Departures  DA_Ratio Continent
183   United States  1995  7.973200e+07  7.403100e+07  0.928498   America
376   United States  1996  8.275600e+07  7.680300e+07  0.928066   America
569   United States  1997  8.252500e+07  7.848100e+07  0.950997   America
762   United States  1998  7.476700e+07  8.275800e+07  1.106879   America
955   United States  1999  7.579600e+07  8.454000e+07  1.115362   America
1148  United States  2000  7.834300e+07  8.797300e+07  1.122921   America
1341  United States  2001  7.097500e+07  8.475500e+07  1.194153   America
1534  United States  2002  6.443400e+07  8.088300e+07  1.255284   America
1727  United States  2003  6.208200e+07  7.588000e+07  1.222254   America
1920  United States  2004  6.760600e+07  7.965500e+07  1.178224   America
2113  United States  2005  7.148400e+07  7.921500e+07  1.108150   America
2306  United States  2006  1.831780e+08  1.485110e+08  0.810747   America
2499  United States  2007  1.752990e+08  1.403640e+08  0.800712   America
2692  United States  2008  1.757030e+08  1.361480e+08  0.774876   America
2885  United States  2009  1.605080e+08  1.299540e+08  0.809642   America
3078  United States  2010  1.622750e+08  1.215740e+08  0.749185   America
3271  United States  2011  1.472714e+08  1.140890e+08  0.774685   America
3464  United States  2012  1.716299e+08  1.163290e+08  0.677790   America
3657  United States  2013  1.793099e+08  1.189680e+08  0.663477   America
3850  United States  2014  1.783114e+08  1.216990e+08  0.682508   America
4043  United States  2015  1.768645e+08  1.303640e+08  0.737084   America
4236  United States  2016  1.752615e+08  1.415260e+08  0.807513   America
4429  United States  2017  1.742918e+08  1.480450e+08  0.849409   America
4622  United States  2018  1.693249e+08  1.584454e+08  0.935748   America
4815  United States  2019  1.654780e+08  1.709301e+08  1.032948   America
5008  United States  2020  4.503700e+07  6.054990e+07  1.344448   America

In [21]:
final[final['Year'] == 2020]['DA_Ratio'].describe()

count    67.000000
mean      0.934644
std       0.823490
min       0.031377
25%       0.276920
50%       0.706881
75%       1.376155
max       3.326730
Name: DA_Ratio, dtype: float64